prep -top multiplier -flatten
aigmap -nand
synth
abc -g NAND
stat -tech cmos
